# RbsPipeFluidViscosityParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeFluidViscosityParam Property
ParameterTypeId Class See Also
---
"Fluid Dynamic Viscosity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeFluidViscosityParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeFluidViscosityParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeFluidViscosityParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace